{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,2,5],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,4,5],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[10],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"reshape_Reshape2","class_name":"Reshape","config":{"target_shape":[20],"name":"reshape_Reshape2","trainable":true},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"dense_Dense8","class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"dense_Dense9","class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true},"inbound_nodes":[[["reshape_Reshape2",0,0,{}]]]},{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,30],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"average_Average1","class_name":"Average","config":{"name":"average_Average1","trainable":true},"inbound_nodes":[[["dense_Dense8",0,0,{}],["dense_Dense9",0,0,{}]]]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":5,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["average_Average1",0,0,{}],["dense_Dense10",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0],["input3",0,0]],"output_layers":[["dense_Dense11",0,0]]},"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense8/kernel","shape":[10,5],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense9/kernel","shape":[20,5],"dtype":"float32"},{"name":"dense_Dense9/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense10/kernel","shape":[30,5],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[5],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[10,1],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1],"dtype":"float32"}]}]}