{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[2,2],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D1","trainable":true,"batch_input_shape":[null,40,40,3],"dtype":"float32","depth_multiplier":2,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true}},{"class_name":"Activation","config":{"activation":"relu","name":"activation_Activation4","trainable":true}},{"class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"depthwise_conv2d_DepthwiseConv2D1/depthwise_kernel","shape":[3,3,3,2],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D1/bias","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[6],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[486,100],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[6],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[6],"dtype":"float32"}]}]}