{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Conv1D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[4],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D1","trainable":true,"batch_input_shape":[null,80,1],"dtype":"float32"}},{"class_name":"MaxPooling1D","config":{"pool_size":[3],"padding":"valid","strides":[3],"name":"max_pooling1d_MaxPooling1D1","trainable":true}},{"class_name":"Conv1D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3],"strides":[1],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D2","trainable":true}},{"class_name":"AveragePooling1D","config":{"pool_size":[5],"padding":"valid","strides":[5],"name":"average_pooling1d_AveragePooling1D1","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true}}],"keras_version":"tfjs-layers 1.1.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv1d_Conv1D1/kernel","shape":[4,1,16],"dtype":"float32"},{"name":"conv1d_Conv1D1/bias","shape":[16],"dtype":"float32"},{"name":"conv1d_Conv1D2/kernel","shape":[3,16,8],"dtype":"float32"},{"name":"conv1d_Conv1D2/bias","shape":[8],"dtype":"float32"}]}]}